app/views/books/_post_books.html.erb

				<i class="fa fa-heart" aria-hidden="true"></i>
				<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]

	  			<i class="far fa-heart" aria-hidden="true"></i>
		   		<%= book.favorites.count %>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]