app/views/books/show.html.erb

						<td>
							コメント数：<%= @book.book_comments.count %>
---
SELECT "books".* FROM "books"
SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]