app/controllers/book_comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "book_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaa"], ["user_id", 1], ["book_id", 2], ["created_at", "2020-04-19 04:50:33.134619"], ["updated_at", "2020-04-19 04:50:33.134619"]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
	def create
		@book = Book.find(params[:book_id])
		@comment = @book.book_comments.new(comment_params)
		# byebug
		@comment.user_id = current_user.id
		if @comment.save
		   @comments = @book.book_comments
			render :action
		else
			@book = Book.find(params[:book_id])

SELECT  "book_comments".* FROM "book_comments" WHERE "book_comments"."id" = ? LIMIT ?  [["id", 33], ["LIMIT", 1]]
DELETE FROM "book_comments" WHERE "book_comments"."id" = ?  [["id", 2]]
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def destroy
		@comment = BookComment.find(params[:id])
		if @comment.destroy
			@book = Book.find(params[:book_id])