app/controllers/favorites_controller.rb

INSERT INTO "favorites" ("user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["book_id", 1], ["created_at", "2020-04-18 11:52:25.732381"], ["updated_at", "2020-04-18 11:52:25.732381"]]
---
def create
	favorite = Favorite.new(user_id: current_user.id, book_id: @book.id)
	favorite.save

SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", 1], ["book_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 64]]
---
def destroy
	favorite = Favorite.find_by(user_id: current_user.id, book_id: @book.id)
	favorite.destroy

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
	def book_params
		@book = Book.find(params[:id])